/*===============================================================================================*/
/*         >>> Copyright (C) Telit Communications S.p.A. Italy All Rights Reserved. <<<          */
/*!
 @file
 	 azx_spi_flash_jsc.h

 @brief
 	 Contains the Software Drivers for SPI NAND FLASH JSC JS28(P_U)xGQSxHG-83 family.

 @details
 	 The file contains interface, return codes and macro for
     the Software Drivers for SPI NAND FLASH JSC JS28(P_U)xGQSxHG-83 family.

 @version
 	 1.0.0

 @note

 @author
 	 Norman Argiolas
 	 Fabio Pintus

 @date
 	 File created on: Feb 24, 2020

 */


#ifndef AZX_SPI_FLASH_JSC_H_
#define AZX_SPI_FLASH_JSC_H_

/* Include files ================================================================================*/
#include "azx_spi_flash_hw_external.h"
#include "azx_spi_flash_types.h"


/* Global defines ================================================================================*/

/* set timeout to 10 seconds for waitForReady operation*/
#define SPI_FLASH_WAITING_TIMEOUT		10000

/*	set delay time to perform flash operation, in milliseconds*/
#define FLASH_DELAY_FOR_READY			150

/* Global typedef ==============================================================================*/
typedef JSC_HANDLE AZX_SPI_FLASH_JSC_HANDLE;

/* free oob descrption */
typedef struct {
	JSC_uint32	offset;
	JSC_uint32	length;
} AZX_SPI_FLASH_OOBFREE;

/* ECC layout description */
typedef struct {
	JSC_uint32				eccbytes;
    JSC_uint32      		eccpos[680];
    JSC_uint32      		oobavail;
    AZX_SPI_FLASH_OOBFREE 	oobfree[4];
} AZX_SPI_FLASH_ECCLAYOUT;

typedef enum
{
  AZX_SPI_FLASH_INITIALIZED = 1,
  AZX_SPI_FLASH_SPI_INITIALIZED,
  AZX_SPI_FLASH_GPIO_INITIALIZED,
  AZX_SPI_FLASH_RESETTED,
  AZX_SPI_FLASH_JSC_CONFIGURED
} AZX_SPI_FLASH_JSC_EVENT_E;

typedef void (*AZX_SPI_FLASH_CLBK_FUNCTION ) (AZX_SPI_FLASH_JSC_HANDLE h, AZX_SPI_FLASH_JSC_EVENT_E event, JSC_uint16 resp_size, void *resp_struct, void *userdata );

typedef struct {
	AZX_SPI_FLASH_JSC_HANDLE	  	clbkHndl;
	AZX_SPI_FLASH_CLBK_FUNCTION 	clbkFunc;
} AZX_SPI_FLASH_EVENT_CALLBACK;

typedef struct {
	AZX_SPI_FLASH_EVENT_CALLBACK   	clbk;	//event callback function
	AZX_SPI_FLASH_SPI_SLAVE  		spi; 	//TODO to delete
	AZX_SPI_FLASH_DESCRIPTOR 		fd;		//spi/gpio file descriptor
	JSC_bool 						init;	//if init=FALSE nand not initialized
} AZX_SPI_FLASH_MICRO_SPI_PARAMS;

typedef struct
{
  AZX_SPI_FLASH_CODE_RESULT_E  		result;
  AZX_SPI_FLASH_MICRO_SPI_PARAMS	opts;
} AZX_SPI_FLASH_JSC_EVENT_RES_T;


/**
 * struct spi_nand_chip - SPI-NAND Private Flash Chip Data
 * @name:                       name of the chip
 * @spi:                        [INTERN] point to spi device structure
 * @mfr_id:                     [BOARDSPECIFIC] manufacture id
 * @dev_id:                     [BOARDSPECIFIC] device id
 * @dev_id2:                    [BOARDSPECIFIC] device id2
 * @read_cache_op:              [REPLACEABLE] Opcode of read from cache
 * @write_cache_op:             [REPLACEABLE] Opcode of program load
 * @write_cache_rdm_op:         [REPLACEABLE] Opcode of program load random
 * @oobbuf:                     [INTERN] buffer for read/write oob
 * @size:                       [INTERN] the size of chip
 * @block_size:                 [INTERN] the size of eraseblock
 * @page_size:                  [INTERN] the size of page
 * @oob_size:                   [INTERN] the size of page oob size
 * @block_shift:                [INTERN] number of address bits in a eraseblock
 * @page_shift:                 [INTERN] number of address bits in a page (column address bits).
 * @pagemask:                   [INTERN] page number mask = number of (pages / chip) - 1
 * @ecc_strength:               [INTERN] ECC correctability
 * @refresh_threshold:          [INTERN] Bitflip threshold to return -EUCLEAN
 * @max_bad_blks_per_lun:       [INTERN] maximum number of invalid blocks
 * @otp_block:                  [INTERN] otp block address
 * @otp_page_start:             [INTERN] otp page start
 * @otp_page_number:            [INTERN] number of otp page
 * @ecclayout:                  [BOARDSPECIFIC] ECC layout control structure
 *                              See the defines for further explanation.
 * @onfi_params:                [INTERN] holds the ONFI page parameter
 */
typedef struct {
    char                        	*name;
    AZX_SPI_FLASH_SPI_SLAVE        	*spi;		//TODO change name becose is the handle of gpio and spi
    AZX_SPI_FLASH_MICRO_SPI_PARAMS	*opts;		//TODO remove one spi pointer or from SPI_NAND_CHIP or from MICRO_SPI_PARAMS

    JSC_bool                    vcc_33;
    JSC_uint8                   mfr_id;
    JSC_uint8                   dev_id;
    JSC_uint8                   dev_id2;
    JSC_uint8                   read_cache_op;
    JSC_uint8                   write_cache_op;
    JSC_uint8                   write_cache_rdm_op;

    JSC_uint8                   *datbuf;
    JSC_uint8                   *oobbuf;
    JSC_uint64                  size;
    JSC_uint32                  block_size;
    JSC_uint16                  page_size;
    JSC_uint16                  oob_size;
    JSC_uint8                   block_shift;
    JSC_uint8                   page_shift;
    JSC_uint16                  page_mask;
    JSC_uint32                  ecc_strength;
    JSC_uint8                   refresh_threshold;
    JSC_uint32                  max_bad_blks_per_lun;
    JSC_uint32                  otp_block;
    JSC_uint32                  otp_page_start;
    JSC_uint32                  otp_page_number;

    AZX_SPI_FLASH_ECCLAYOUT   		*ecclayout;
} AZX_SPI_FLASH_SPI_CHIP;


/**
 * oob operation modes
 *
 * @MTD_OPS_PLACE_OOB:  OOB data are placed at the given offset (default)
 * @MTD_OPS_AUTO_OOB:   OOB data are automatically placed at the free areas
 *                      which are defined by the internal ecclayout
 * @MTD_OPS_RAW:        data are transferred as-is, with no error correction;
 *                      this mode implies %MTD_OPS_PLACE_OOB
 */
enum {
    MTD_OPS_PLACE_OOB           = 0,
    MTD_OPS_AUTO_OOB            = 1,
    MTD_OPS_RAW                 = 2,
};


/**
 * struct MTD_OOB_OPS - oob operation operands
 * @mode:       operation mode
 * @len:        number of data bytes to write/read
 * @retlen:     number of data bytes written/read
 * @ooblen:     number of oob bytes to write/read
 * @oobretlen:  number of oob bytes written/read
 * @ooboffs:    offset of oob data in the oob area (only relevant when mode = MTD_OPS_PLACE_OOB or
 *              MTD_OPS_RAW)
 * @datbuf:     data buffer - if NULL only oob data are read/written
 * @oobbuf:     oob data buffer
 *
 * Note, it is allowed to read more than one OOB area at one go, but not write.
 * The interface assumes that the OOB write requests program only one page's
 * OOB area.
 */
typedef struct {
	JSC_uint32	mode;
	JSC_size_t	len;
    JSC_size_t  retlen;
    JSC_size_t  ooblen;
    JSC_size_t  oobretlen;
    JSC_uint32  ooboffs;
    JSC_uint8   *datbuf;
    JSC_uint8   *oobbuf;
} AZX_SPI_FLASH_MTD_OOB_OPS;


typedef struct __attribute__((packed)) {
    /* rev info and features block */
    /* 'O' 'N' 'F' 'I'  */
	JSC_uint8		sig[4];                     /*<0-3*/
	JSC_uint16      revision;                   /*4-5*/
	JSC_uint16      features;                   /*6-7*/
	JSC_uint16      opt_cmd;                    /*8-9*/
    JSC_uint8       reserved0[22];              /*10-31*/

    /* manufacturer information block */
    char            manufacturer[12];           /*32-43*/
    char            model[20];                  /*44-63*/
    JSC_uint8       mfr_id;                     /*64*/
    JSC_uint16      date_code;                  /*65-66*/
    JSC_uint8       reserved1[13];              /*67-79*/

    /* memory organization block */
    JSC_uint32      byte_per_page;              /*80-83*/
    JSC_uint16      spare_bytes_per_page;       /*84*85*/
    JSC_uint32      data_bytes_per_ppage;       /*86-89*/
    JSC_uint16      spare_bytes_per_ppage;      /*90-91*/
    JSC_uint32      pages_per_block;            /*92-95*/
    JSC_uint32      blocks_per_lun;             /*96-99*/
    JSC_uint8       lun_count;                  /*100*/
    JSC_uint8       addr_cycles;                /*101*/
    JSC_uint8       bits_per_cell;              /*102*/
    JSC_uint16      bb_per_lun;                 /*103-104*/
    JSC_uint16      block_endurance;            /*105-106*/
    JSC_uint8       guaranteed_good_blocks;     /*107*/
    JSC_uint16      guaranteed_block_endurance; /*108-109*/
    JSC_uint8       programs_per_page;          /*110*/
    JSC_uint8       page_attr;                  /*111*/
    JSC_uint8       ecc_bits;                   /*112*/
    JSC_uint8       interleaved_bits;           /*113*/
    JSC_uint8       interleaved_ops;            /*114*/
    JSC_uint8       reserved2[13];              /*115-127*/

    /* electrical parameter block */
    JSC_uint8       io_pin_capacitance_max;     /*128*/
    JSC_uint16      timing_mode;                /*129-130*/
    JSC_uint16      program_cache_timing_mode;  /*131-132*/
    JSC_uint16      t_prog;                     /*133-134*/
    JSC_uint16      t_bers;                     /*135-136*/
    JSC_uint16      t_r;                        /*137-138*/
    JSC_uint16      t_ccs;                      /*139-140*/
    JSC_uint8       reserved3[23];   /*141-163*/

    /* vendor */
    JSC_uint16      vendor_specific_revision;   /*164-165*/
    JSC_uint8       vendor_specific[88];        /*166-253*/

    JSC_uint16      crc;                        /*254-255*/
} AZX_SPI_FLASH_ONFI_PARAMS;



/* block lock register defines
* Register Bit Address
*   | 7    | 6        | 5   | 4   | 3   | 2   | 1   | 0        |
*   |----------------------------------------------------------|
*   | BRWD | Reversed | BP2 | BP1 | BP0 | INV | CMP | Reversed |
*
* Block Lock Register Block Protection Bits
*/
